; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v9 ?v10)
             (pred_12 ?v7 ?v2)
             (pred_1 ?v9 ?v2)
             (pred_11 ?v13 ?v9 )
	     (pred_10 ?v9)
             (pred_7 ?v5)
             (pred_6 ?v7)
             (pred_5 ?v2)
             (pred_2 ?v9)
             (pred_4 ?v7)
             (pred_8 ?v9)
             (pred_3 ))



(:action op_1
:parameters (?v6 ?v8 ?v1 ?v12)
:precondition (and (pred_7 ?v6) (pred_7 ?v8) (pred_6 ?v1) (pred_5 ?v12)
          (pred_9 ?v6 ?v8) (pred_12 ?v1 ?v12)
                   (pred_1 ?v8 ?v12) (pred_10 ?v6) 
                   (pred_2 ?v8) (pred_4 ?v1))
:effect (and  (pred_8 ?v8) (not (pred_2 ?v8))))


(:action op_4
:parameters (?v6 ?v3)
:precondition (and (pred_7 ?v6) (pred_7 ?v3)
               (pred_10 ?v6) (pred_9 ?v6 ?v3) (pred_8 ?v3))
:effect (and (pred_10 ?v3) (not (pred_10 ?v6))))

(:action op_5
:parameters (?v6 ?v1)
:precondition (and (pred_7 ?v6) (pred_6 ?v1) 
                  (pred_10 ?v6) (pred_11 ?v1 ?v6) (pred_3 ))
:effect (and (pred_4 ?v1)
   (not (pred_11 ?v1 ?v6)) (not (pred_3 ))))


(:action op_3
:parameters (?v6 ?v4 ?v11)
:precondition (and (pred_7 ?v6) (pred_6 ?v4) (pred_6 ?v11)
                  (pred_10 ?v6) (pred_4 ?v11) (pred_11 ?v4 ?v6))
:effect (and (pred_4 ?v4) (pred_11 ?v11 ?v6)
        (not (pred_4 ?v11)) (not (pred_11 ?v4 ?v6))))

(:action op_2
:parameters (?v6 ?v1)
:precondition (and (pred_7 ?v6) (pred_6 ?v1) 
                  (pred_10 ?v6) (pred_4 ?v1))
:effect (and (pred_3 ) (pred_11 ?v1 ?v6) (not (pred_4 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_20 obj_09 obj_19 obj_07 obj_03 obj_17 obj_04 obj_16 obj_08 obj_18 obj_05 obj_11 obj_13 obj_10 obj_02 obj_01
    obj_12 obj_15
    obj_14 obj_06
    )

    (:init
       (pred_3)

       (pred_7 obj_20)
       (pred_7 obj_09)
       (pred_7 obj_19)
       (pred_7 obj_07)
       (pred_7 obj_03)
       (pred_7 obj_17)
       (pred_7 obj_04)
       (pred_7 obj_16)
       (pred_7 obj_08)
       (pred_7 obj_18)
       (pred_7 obj_05)
       (pred_7 obj_11)
       (pred_7 obj_13)
       (pred_7 obj_10)
       (pred_7 obj_02)
       (pred_7 obj_01)
       (pred_5 obj_12)
       (pred_5 obj_15)
       (pred_6 obj_14)
       (pred_6 obj_06)

       (pred_9 obj_20 obj_03)
       (pred_9 obj_20 obj_09)
       (pred_9 obj_09 obj_17)
       (pred_9 obj_09 obj_19)
       (pred_9 obj_09 obj_20)
       (pred_9 obj_19 obj_04)
       (pred_9 obj_19 obj_07)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_07 obj_16)
       (pred_9 obj_07 obj_19)
       (pred_9 obj_03 obj_08)
       (pred_9 obj_03 obj_17)
       (pred_9 obj_03 obj_20)
       (pred_9 obj_17 obj_18)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_17 obj_09)
       (pred_9 obj_17 obj_03)
       (pred_9 obj_04 obj_05)
       (pred_9 obj_04 obj_16)
       (pred_9 obj_04 obj_19)
       (pred_9 obj_04 obj_17)
       (pred_9 obj_16 obj_11)
       (pred_9 obj_16 obj_07)
       (pred_9 obj_16 obj_04)
       (pred_9 obj_08 obj_13)
       (pred_9 obj_08 obj_18)
       (pred_9 obj_08 obj_03)
       (pred_9 obj_18 obj_10)
       (pred_9 obj_18 obj_05)
       (pred_9 obj_18 obj_17)
       (pred_9 obj_18 obj_08)
       (pred_9 obj_05 obj_02)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_05 obj_04)
       (pred_9 obj_05 obj_18)
       (pred_9 obj_11 obj_01)
       (pred_9 obj_11 obj_16)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_13 obj_10)
       (pred_9 obj_13 obj_08)
       (pred_9 obj_10 obj_02)
       (pred_9 obj_10 obj_18)
       (pred_9 obj_10 obj_13)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_02 obj_05)
       (pred_9 obj_02 obj_10)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_01 obj_02)
       (pred_2 obj_17)
       (pred_2 obj_02)
       (pred_1  obj_17 obj_12)
       (pred_1  obj_02 obj_15)
       (pred_8 obj_20)
       (pred_8 obj_09)
       (pred_8 obj_19)
       (pred_8 obj_07)
       (pred_8 obj_03)
       (pred_8 obj_04)
       (pred_8 obj_16)
       (pred_8 obj_08)
       (pred_8 obj_18)
       (pred_8 obj_05)
       (pred_8 obj_11)
       (pred_8 obj_13)
       (pred_8 obj_10)
       (pred_8 obj_01)

       (pred_12  obj_14 obj_12)
       (pred_12  obj_06 obj_15)
       (pred_11 obj_14 obj_01)
       (pred_11 obj_06 obj_19)
       (pred_10 obj_04)
    )

    (:goal (and
       (pred_11 obj_14 obj_17)
    ))
(:constraints
  (always (not (pred_10 obj_16)))
)
)

; plan
1. (op_4 obj_04 obj_05)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_05)
   goals met: 0 of 1
2. (op_4 obj_05 obj_11)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_11)
   goals met: 0 of 1
3. (op_4 obj_11 obj_01)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_01)
   goals met: 0 of 1
4. (op_5 obj_01 obj_14)
   deleted: (pred_11 obj_14 obj_01) (pred_3)
   added: (pred_4 obj_14)
   goals met: 0 of 1
5. (op_4 obj_01 obj_11)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_11)
   goals met: 0 of 1
6. (op_4 obj_11 obj_05)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_05)
   goals met: 0 of 1
7. (op_4 obj_05 obj_04)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_04)
   goals met: 0 of 1
8. (op_1 obj_04 obj_17 obj_14 obj_12)
   deleted: (pred_2 obj_17)
   added: (pred_8 obj_17)
   goals met: 0 of 1
9. (op_4 obj_04 obj_17)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_17)
   goals met: 0 of 1
10. (op_2 obj_17 obj_14)
   deleted: (pred_4 obj_14)
   added: (pred_3) (pred_11 obj_14 obj_17)
   goals met: 1 of 1
